{"device":"Kids","url":"http:\/\/makeprojects.com\/Project\/Intro+to+Scratch\/1141\/1","guide":{"author":{"text":"Jeremy Kerfs","userid":6702},"categories":["Kids","Programming"],"conclusion":"<h3 id=\"Section_References_and_Community\">References and Community<\/h3>\n\n<p>Scratch is well documented at <a href=\"http:\/\/info.scratch.mit.edu\/\" rel=\"nofollow\">http:\/\/info.scratch.mit.edu\/<\/a> support, which has a good How to Get Started document and a Reference Guide that documents all of the blocks. With these resources, you should have no trouble creating your projects. And if you want some inspiration for coming up with ideas, the Scratch website also boasts more than 500,000 projects you can view and play online. To explore what others are doing with Scratch, go to <a href=\"http:\/\/scratch.mit.edu\/channel\/recent\" rel=\"nofollow\">http:\/\/scratch.mit.edu\/channel\/recent<\/a>.<\/p>\n\n<p>The Scratch community lets you share your projects and comment on others. To join, go to <a href=\"http:\/\/scratch.mit.edu\/signup\" rel=\"nofollow\">http:\/\/scratch.mit.edu\/signup<\/a>. Sharing your project is as easy as clicking Share at the top of the Scratch window and then choosing “Share this program online.” If you like someone else’s project, you can download and change it yourself, which is a great way to learn. But if you gain inspiration (or code) from other people’s projects, make sure you credit them.<\/p>\n\n<p>For people to play your Scratch games directly, they need to have Scratch installed on their own machines. But there are also ways of converting Scratch projects into .exe executable files that will run on any Windows machine.<\/p>\n\n<p>Visit <a href=\"http:\/\/makezine.com\/21\/diykids_scratch\">http:\/\/makezine.com\/21\/diykids_scratch<\/a> for downloadable examples of user created games.<\/p>\n\n<p><strong>This project first appeared in <a href=\"http:\/\/makezine.com\/21\">MAKE Volume 21<\/a>, page133.<\/strong><\/p>","difficulty":"Easy","documents":[],"flags":[{"title":"From MAKE Magazine","flagid":"FROM_MAKE","text":"This project first appeared on the pages of MAKE magazine."}],"guideid":1141,"image":{"imageid":22183,"text":"http:\/\/guide-images.makeprojects.org\/igi\/AJNnFaNRHYKqH5CR"},"introduction":"<p>The big video game companies create best-selling titles every year, but for the rest of us, bringing our own unique game ideas from wishful thinking into reality is notoriously difficult.<\/p>\n\n<p>Creating even the simplest functionality can take tens of thousands of lines of code. Luckily, the MIT Media Lab has created free software, Scratch (scratch.mit.ed<wbr \/>u), that lets kids create their own games or interactive stories using an easy drag-and-drop interface and some elementary programming.<\/p>\n\n<p>Download, install, and launch Scratch, and soon you’ll be creating simple “side-scrollers” — games like Super Mario Bros., where characters navigate obstacles left-to-right. You can also make your characters communicate via speech balloons, like an animated cartoon. Scratch makes no distinction between games and animations; it’s all in your programming.<\/p>","introduction_rendered":"<p>The big video game companies create best-selling titles every year, but for the rest of us, bringing our own unique game ideas from wishful thinking into reality is notoriously difficult.<\/p>\n\n<p>Creating even the simplest functionality can take tens of thousands of lines of code. Luckily, the MIT Media Lab has created free software, Scratch (scratch.mit.ed<wbr \/>u), that lets kids create their own games or interactive stories using an easy drag-and-drop interface and some elementary programming.<\/p>\n\n<p>Download, install, and launch Scratch, and soon you’ll be creating simple “side-scrollers” — games like Super Mario Bros., where characters navigate obstacles left-to-right. You can also make your characters communicate via speech balloons, like an animated cartoon. Scratch makes no distinction between games and animations; it’s all in your programming.<\/p><div class=\"tools\"><strong>Tools<\/strong><ul><li><a href=\"http:\/\/makeprojects.com\/Item\/Computer\">Computer<\/a><\/li><li><a href=\"http:\/\/scratch.mit.edu\">Scratch software<\/a><\/li><\/ul><\/div>","locale":"en","parts":[],"prereqs":[],"steps":[{"title":"How Scratch works.","lines":[{"text":"In software parlance, Scratch is an object-oriented, event-driven, visual programming environment. Let’s take those terms separately.","text_raw":"In software parlance, Scratch is an object-oriented, event-driven, visual programming environment. Let’s take those terms separately.","bullet":"black","level":0},{"text":"<strong>Object-oriented<\/strong> means that you design each  character in your game (each sprite) by putting together scripts that dictate its behavior. Then when you run the game, the sprites all just do their own thing. To influence each other, the sprites pass coded messages called broadcasts.","text_raw":"'''Object-oriented''' means that you design each  character in your game (each sprite) by putting together scripts that dictate its behavior. Then when you run the game, the sprites all just do their own thing. To influence each other, the sprites pass coded messages called broadcasts.","bullet":"black","level":1},{"text":"<strong>Event-driven<\/strong> means that every script you assemble for each sprite runs in reaction to some triggering event, like when the player clicks on the sprite, or hits one of the keyboard keys, or when another sprite broadcasts a message.","text_raw":"'''Event-driven''' means that every script you assemble for each sprite runs in reaction to some triggering event, like when the player clicks on the sprite, or hits one of the keyboard keys, or when another sprite broadcasts a message.","bullet":"black","level":1},{"text":"<strong>Visual programming<\/strong> environment means that blocks on the screen represent basic programming elements, and you assemble a series of instructions by dragging-and-dropping the blocks together into stacks. The blocks are color-coded and shaped so they only fit together in ways that make sense programmatically: the triggering events look like folder tabs, and the subsequent steps fit together like jigsaw puzzle pieces. Numbers fit into round holes, text strings fit into rectangular text boxes, and conditionals fit into diamond-sided holes that look like decision points in a flowchart.","text_raw":"'''Visual programming''' environment means that blocks on the screen represent basic programming elements, and you assemble a series of instructions by dragging-and-dropping the blocks together into stacks. The blocks are color-coded and shaped so they only fit together in ways that make sense programmatically: the triggering events look like folder tabs, and the subsequent steps fit together like jigsaw puzzle pieces. Numbers fit into round holes, text strings fit into rectangular text boxes, and conditionals fit into diamond-sided holes that look like decision points in a flowchart.","bullet":"black","level":1}],"object":null,"images":[{"imageid":22183,"orderby":1,"text":"http:\/\/guide-images.makeprojects.org\/igi\/AJNnFaNRHYKqH5CR"}],"number":1},{"title":"Get familiar with the screen.","lines":[{"text":"Scratch’s main screen has 3 columns:","text_raw":"Scratch’s main screen has 3 columns:","bullet":"black","level":0},{"text":"The <em>program blocks<\/em> are on the left, organized into menus by type.","text_raw":"The ''program blocks'' are on the left, organized into menus by type.","bullet":"black","level":1},{"text":"The middle column is where you stack the blocks into a sprite’s <em>scripts.<\/em> Tabs at the top also let you customize the sprite’s costumes (the different ways it can appear) and the sounds it can make. You can select costumes from a native library of animals, things, and people, or else design your own using the Paint Editor pane. Similarly, you can select sounds from a library of effects, or record your own by clicking the Record button.","text_raw":"The middle column is where you stack the blocks into a sprite’s ''scripts.'' Tabs at the top also let you customize the sprite’s costumes (the different ways it can appear) and the sounds it can make. You can select costumes from a native library of animals, things, and people, or else design your own using the Paint Editor pane. Similarly, you can select sounds from a library of effects, or record your own by clicking the Record button.","bullet":"black","level":1},{"text":"The right column contains the stage, where the game’s action takes place. When you first open the program, the stage is a white rectangle containing one sprite, the orange cat that’s Scratch’s icon. To run and stop your game, you click the green flag or the stop-sign button above the stage.","text_raw":"The right column contains the stage, where the game’s action takes place. When you first open the program, the stage is a white rectangle containing one sprite, the orange cat that’s Scratch’s icon. To run and stop your game, you click the green flag or the stop-sign button above the stage.","bullet":"black","level":1},{"text":"Below the stage, you see thumbnails of all the sprites in your game. This is where you manage your cast of characters, creating new sprites and selecting the one you’re working on. There’s also a thumbnail for the stage itself, because it works as a special sprite; you can control its appearance, to paint backdrops, for example, but you can’t make it move around.","text_raw":"Below the stage, you see thumbnails of all the sprites in your game. This is where you manage your cast of characters, creating new sprites and selecting the one you’re working on. There’s also a thumbnail for the stage itself, because it works as a special sprite; you can control its appearance, to paint backdrops, for example, but you can’t make it move around.","bullet":"black","level":0}],"object":null,"images":[{"imageid":22190,"orderby":1,"text":"http:\/\/guide-images.makeprojects.org\/igi\/OtcuUZf2V33ohiq4"},{"imageid":22189,"orderby":2,"text":"http:\/\/guide-images.makeprojects.org\/igi\/WK6m35hxNq2MGGNB"},{"imageid":22191,"orderby":3,"text":"http:\/\/guide-images.makeprojects.org\/igi\/XnnsusgxmxvEbeRT"}],"number":2},{"title":"Learn to walk the cat.","lines":[{"text":"To illustrate Scratch programming technique, here’s how you can make the cat move with the arrow keys. To start a program, open the Control program blocks on the left and drag the first block, <em>when (green flag) clicked<\/em>, into the center of the Scripts pane. This block instructs the program to start this script as soon as the program is started.","text_raw":"To illustrate Scratch programming technique, here’s how you can make the cat move with the arrow keys. To start a program, open the Control program blocks on the left and drag the first block, ''when (green flag) clicked'', into the center of the Scripts pane. This block instructs the program to start this script as soon as the program is started.","bullet":"black","level":0},{"text":"The Control tab contains blocks that trigger scripts and blocks that determine their flow, such as loops and <em>if<\/em> statements. Add a <em>forever<\/em> block under the green flag block; this sets up an endless listen-respond loop. Next, drag 4 <em>if<\/em> blocks into the <em>forever<\/em> loop. We’ll use these to check for the 4 different arrow keys.","text_raw":"The Control tab contains blocks that trigger scripts and blocks that determine their flow, such as loops and ''if'' statements. Add a ''forever'' block under the green flag block; this sets up an endless listen-respond loop. Next, drag 4 ''if'' blocks into the ''forever'' loop. We’ll use these to check for the 4 different arrow keys.","bullet":"black","level":0},{"text":"Look under the Sensing tab and drag a <em>key [space] pressed?<\/em> block into one of the if block slots. In this game, we want to know if the arrow keys are pressed, not the space bar, so click the box in the block and change space to one of the arrow keys. Fill the other 3 <em>if<\/em> blocks to sense the other 3 arrows.","text_raw":"Look under the Sensing tab and drag a ''key [space] pressed?'' block into one of the if block slots. In this game, we want to know if the arrow keys are pressed, not the space bar, so click the box in the block and change space to one of the arrow keys. Fill the other 3 ''if'' blocks to sense the other 3 arrows.","bullet":"black","level":0},{"text":"Under the Motion category, move a <em>change x by 10<\/em> block into the <em>if<\/em> blocks for the right and left arrows, and a <em>change y by 10<\/em> into the up\/down blocks. To correct the directions for left and down, put a minus sign (–) in front of the 10.","text_raw":"Under the Motion category, move a ''change x by 10'' block into the ''if'' blocks for the right and left arrows, and a ''change y by 10'' into the up\/down blocks. To correct the directions for left and down, put a minus sign (–) in front of the 10.","bullet":"black","level":0},{"text":"Your program should look like the photo. Click the green flag, and you should be able to maneuver the cat around the screen. You can see that the if statements inside the forever loop evaluate as true if the key is pressed and false if not. The movement blocks then adjust the position of the cat accordingly.","text_raw":"Your program should look like the photo. Click the green flag, and you should be able to maneuver the cat around the screen. You can see that the if statements inside the forever loop evaluate as true if the key is pressed and false if not. The movement blocks then adjust the position of the cat accordingly.","bullet":"black","level":0}],"object":null,"images":[{"imageid":22188,"orderby":1,"text":"http:\/\/guide-images.makeprojects.org\/igi\/lfx4iSuQeBJqUHsD"}],"number":3}],"subject":"","summary":"Make your own games and animations, free and easy.","time_required":"","title":"Intro to Scratch","tools":[{"text":"Computer","notes":"","url":"http:\/\/makeprojects.com\/Item\/Computer","thumbnail":""},{"text":"Scratch software","notes":"","url":"http:\/\/scratch.mit.edu","thumbnail":""}],"type":"project"},"guideid":"1141"}