{"device":"Outdoors","url":"http:\/\/makeprojects.com\/Project\/How+to+Build+A+Ball+Pit+On+Your+Balcony\/1506\/1","guide":{"author":{"text":"Kevin Hunt","userid":8137},"categories":["Outdoors","Furniture"],"conclusion":"<p>Use the tarp to cover your ball pit – especially if it’s outdoors.  You will want to keep rain and dust out of it as much as possible, as it would be quite a chore to clean THOUSANDS of balls every time there was a rainstorm.<\/p>\n\n<p>When it does come time to clean your ball pit, remove them all the balls and store them in garbare bags. Clean the interior of your ball pit with any GENTLE cleaner that is safe to use on foam or rubber and be sure to give it ample time to dry before re-adding any balls.  Take a few hundred balls at a time and wash them in your bathtub and\/or spray them down with a one part bleach, nine-part water solution before put them somewhere to dry.  DO NOT PUT DAMP BALLS INTO YOUR BALL PIT. Repeat washing, drying, and then re-adding your balls to your ball pit until all are clean.<\/p>","difficulty":"Moderate","documents":[],"flags":[{"title":"User-Contributed Project","flagid":"GUIDE_USER_CONTRIBUTED","text":"This project guide is not managed by MAKE staff."}],"guideid":1506,"image":{"imageid":0,"text":"http:\/\/cacher.dozuki.net\/static\/images\/make\/guide\/NoImageMP_96x72.gif"},"introduction":"<p>A lot of people have asked “Why would you, as an adult, want to own a ball pit?” And the answer every time is “because of <a href=\"http:\/\/xkcd.com\/150\/\" rel=\"nofollow\">this xkcd comic<\/a>.” There’s something about a ball pit that just screams PURE FUN. You cant sit in a ball pit and not smile. It’s like you turn to jello and float on plastic bubbles of multi-colored joy. I have spent a large portion of my summer in my balcony ball pit, and I could go on about stress-relieving effects, or about “deciding what ‘being an adult’ means in the 21st century”, or even about how this is probably something you dreamed about as a child\/teenager\/<wbr \/>college student, but really, it’s a ball pit on a balcony. How does that NOT sound awesome?<\/p>","introduction_rendered":"<p>A lot of people have asked “Why would you, as an adult, want to own a ball pit?” And the answer every time is “because of <a href=\"http:\/\/xkcd.com\/150\/\" rel=\"nofollow\">this xkcd comic<\/a>.” There’s something about a ball pit that just screams PURE FUN. You cant sit in a ball pit and not smile. It’s like you turn to jello and float on plastic bubbles of multi-colored joy. I have spent a large portion of my summer in my balcony ball pit, and I could go on about stress-relieving effects, or about “deciding what ‘being an adult’ means in the 21st century”, or even about how this is probably something you dreamed about as a child\/teenager\/<wbr \/>college student, but really, it’s a ball pit on a balcony. How does that NOT sound awesome?<\/p>","locale":"en","parts":[],"prereqs":[],"steps":[],"subject":"","summary":"Step-by-step instructions on how to build a ball pit on your balcony.","time_required":"2 to 4 hours","title":"How to Build A Ball Pit On Your Balcony","tools":[],"type":"project"},"guideid":"1506"}