{"device":"Outdoors","url":"http:\/\/makeprojects.com\/Project\/El+dise%C3%B1o+de+la+iluminaci%C3%B3n+de+LED+iluminaci%C3%B3n+para+t%C3%BAnel\/125\/1","guide":{"author":{"text":"alice wu","userid":203},"categories":["Outdoors","Science Projects"],"conclusion":"","difficulty":"Moderate","documents":[],"flags":[{"title":"User-Contributed Project","flagid":"GUIDE_USER_CONTRIBUTED","text":"This project guide is not managed by MAKE staff."}],"guideid":125,"image":{"imageid":3076,"text":"http:\/\/guide-images.makeprojects.org\/igi\/B2QlDkxOvxWKRaHo"},"introduction":"<p>A la diferencia de la iluminación ordinaria, LED iluminación para túnel tiene tiene su especificidad diferenciada. Es especialmente importante considerar la seguridad en el sistema de iluminación.<\/p>\n\n<p>Cuándo diseña el plan de iluminación del túnel, es necesario pensar que se ajusten y cumplan con los elementos de la oscuridad y brillo. Con el fin de satisfacer las demandas de cumplimiento de los ojos de los conductores necesita hacer iluminación y oscuridad de la transición en la entrada del túnel para garantizar la demanda de la visión. No hay otra forma de disposición por poco tiempo con menos de la habitual en el 1s en la salida del túnel.<\/p>\n\n<p>Túnel es un bloque de espacio cerrado, la luz natural no puede brillar lo interior. Incluso todo el día también necesita la iluminación artificial interior para garantizar la conectividad y la seguridad de la vida de los conductores. La iluminación de túneles es una parte integral para el proyecto del tunél.<\/p>\n\n<p>La discusión de la aplicación de la nueva fuente de luz de ahorro de energía fue la preocupación de la industria. La discusión de energía de ahorro de LED túnel que ha sido una grave perturbación. Según la visión clara y la teoría de la visión intermedia, el resultado de la investigación científica del color y la iluminación. La iluminación LED utilizados en el túnel tiene una ventaja. Por lo tanto, se han utilizado LED iluminación para túnel en muchos e importantes proyectos nacionales. LED Iluminación del túnel tuvo una alta interrupción en la aplicación del proyecto de la iluminación. Sin embargo, aún existen problemas. Por ejemplo, no dirige específicamente el diseño del fuente de LED iluminación de túnel y construcción de normas, el rendimiento del producto varía en gran medida, etc. En Europea 60% de los túneles se encuentran en Italia. Este es una aplicación práctica de los casos túnel en Roma, Italia.<\/p>\n\n<p>Escape de los automóviles, el ruido, la vibración, el aire puro, gases corrosivos, humedad y duras medio ambiente forma naturaleza especial de LED iluminación para túneles. Con el fin de garantir la seguridad a los vehículos de comunicación y peatones ambiente, Aquí están los siguientes análisis para describir pensamientos diseño y los métodos de la iluminación de túnel.<\/p>\n\n<p>SPARK adopta el tipo cuadrado de LED luz del túnel, por el presente tenemos LED1W 114-122Lm \/ W, Voltaje de 3.2V, alimentación de corriente 320hA. Por lo tanto, el trabajo práctico de una unidad LED es 1.024W, la potencia total de la fuente de la luz de 56 unidades son 61.6W. Nuestra eficiencia de poder de conversión es 86%, por lo tanto la potencia total son 72.6W, hay 103 unidades en túnel de 736m, total potencia 103×71.6=7374.8<wbr \/>.8W. Según el calculo de las 24 horas al día, el consumo de energía total es aproximadamente de 215,3 kWh de electricidad, alrededor de 71 950Kwh al año.<\/p>\n\n<p>La longitud del túnel son 736 metros, se adoptan LED iluminación de túnel con el control inteligente, en lugar de la manera de la práctica de cierre directa nocturno de la lámpara sodio tradicional, por lo tanto necesarias reajustar el brillo general de la unidad de lámpara densidad según la demanda del brillo del aire. El dispositivo anterior de planificación de lámpara sodio, constituyen tres regiones de brillo al abrir la luz brillante, el agujero de intervalo de 0 ~ 30 m es una región de alto brillo, la iluminación es 80lux, 30~60 m es una región de medio brillo, es 50lux, 60~96 m es una región de medio brillo, es 40lux, el brillo de unos 30Lux. Están poca luz en todo el túnel cuando se apaga las luces brillantes en la noche, es 30lux.<\/p>\n\n<p>Despues de adoptar la transformación de LED iluminación para túnel, se adoptar el control inteligente para controlar el brillo de la luz en la salida y entrada del túnel con 40 unidades LED iluminación para túnel, los 63 unidades en el medio lugar se trabajo con todo potencia para todo el año, el número total de luces son 103 unidades, son más 7 unidades que el diseño anterior. La manera con detalle es que instala un controlador sensible a la luz en la salida y entrada del túnel, adquirir la señal óptica, la señal óptica controla directamente la luminosidad de 40 unidades de LED lámpara del túnel, trabaja tomando el poder total a las buenas horas en el día, media potencia en la noche, el brillo cambia de acuerdo con los cambios de brillo del entorno externo, el controlador no consume electricidad. Todas lámparas a la salida y entrada trabaja con total potencia a las horas de buena luz fuera del túnel del día. En este punto el brillo puede satisfacesr completamente a la solicitud de 80,50,30 Lux. La luminosa es 40lux después de las lámparas trabaja con media potencia en la noche, todavía es 30lux dentro del túnel. Si usted no exige que el brillo cambia con el cambio del medio ambiente, puede establecer directamente un horario fijo para cambiar el brillo de LED lámpara del túnel.<\/p>\n\n<p>　<\/p>\n\n<p>Tiene los siguientes problemas especiales de carácter de la visión para general túnel.<\/p>\n\n<p>（1）Antes de entrar en el túnel (días): Como las grandes diferencias en el brillo dentro y fuera del túnel, así que verá un &quot;agujero negro&quot; fenómeno en la entrada del túnel con poco luz desde el exterior del túnel.<\/p>\n\n<p>（2）Despues de entrar en el túnel (días): Tras coche entrar al dentro del túnel con un poco más brillo, debe tener algún tiempo para ver la situación del interior del túnel, conocido como &quot;adaptación de histéresis&quot; retraso fenómeno.<\/p>\n\n<p>（3）A la salida del túnel, cuándo los coches pasan largo túnel y está cerca de la salida en el día. Parece un &quot;agujero blanco&quot; por mucho brillo a la salida, mostrará fuerte resplandor, los conductores se sienten no adaptable. Es contrario completamente noche y día,<\/p>\n\n<p>entonces aparece no &quot;agujero blanco&quot; pero &quot;agujero negro&quot; a la salida. Así que los conductores no puede ver línea de la carretera externos y los obstáculos en el camilo.<\/p>\n\n<p>Los superiores problemas más específica de visión necesita la solicitud con bastante demanda para la iluminación del túnel, puede resolvar eficaz estos problemas por los siguientes maneras;<\/p>\n\n<p>１、La colocación de la iluminación del túnel.<\/p>\n\n<p>La iluminación general del túnel se divide las cinco secciones de la iluminación como La sección de introducción, la sección de adaptación, la sección de transición, el segmento básico y la sección de la salida etc. Cada sección tiene mo la sección de introducción, cumplir con la sección, la sección de transiun papel diferente.<\/p>\n\n<p>（1）La sección de introducción: Eliminar el &quot;agujero negro&quot; fenómeno para que los conductores pueda identificar los obstáculos en la salida del túnel: Toma el día como el ejemplo, suponga que el brillo del medio ambiente de la boca del túnel son 4000cd\/m2, 80 km\/H a la velocidad, por lo tante puede satisfacer la demanda mínima de la sección de introducción con la larga 40 metros y brillo 80cd\/m2.<\/p>\n\n<p>（2）La sección de adaptación: despues de entrar en el túnel, los conductores puede adoptar rápida y eliminar el &quot;agujero negro&quot; fenómeno; Según las condiciones superiores, la sección de adaptación son 40 metros y brillo 80~46cd\/m2.<\/p>\n\n<p>（3）La sección de transición: Los conductores poco a poco adaptan la iluminación en el interior de los túneles; Según las condiciones superiores, la sección de adaptación son 40 metros y brillo 40~4.5cd\/m.<\/p>\n\n<p>（4）La sección del segmento básico: La iluminación básicas dentro del túnel<\/p>\n\n<p>（5）La sección de la salida: Los conductores poco a poco adaptan la iluminación en el interior de los túneles en el día, eliminar el &quot;agujero blanco&quot; fenómeno; La práctica común es que iluminan continuamente por LED alumbrado público al lugar fuera del túnel para que los conductores pueda ver línea de la carretera externos y los obstáculos en el camilo y eliminar el &quot;agujero negro&quot; fenómeno en la noche.<\/p>\n\n<p>Durante el día, la luz de la salida y la de la entrada es más brillante que la que interior en el túnel; Por el contrario, en la noche la cuál debe ser inferior al la interior. Cuando led alumbrado público está iluminando fuera del túnel, el brillo en el aire son dos veces al que en el suelo del túnel.<\/p>\n\n<p>2、Los problemas existidos en el proceso de que los vehículos pasan.<\/p>\n\n<p>3、Los problemas existidos en el proceso cerca de túnel<\/p>\n\n<p>（1）El &quot;agujero negro&quot; fenómeno<\/p>\n\n<p>En el día, los ojos del conductor se han adaptado la luz natural exterior de más 100000 lx y unos mil cd\/m2, cuando los ojos se encuentra unos cd\/m2 de brillo en el túnel, presenta histéresis debido a la limitad de la percepción de los ojos humanos a la diferencia del brillo, Verás una cueva negro, entonces no puede identificar lo que estaba en el túnel. Este fenómeno de ver el agujero negro en el medio ambiente brillante se llama el fenómeno de agujero negro al cuál sale, los conductores sólo puede ver corto visión , no puede conducir con seguridad con el vehículo cerca del túnel. Negro agujero es el problema producido antes entrar en el túnel, de la aparición del fenómeno de problemas visuales, es el problema más importante en la iluminación del túnel. Para evitar la aparición del fenómeno de agujero negro, debe garantizar el suficiente brillo a los intervales de la sección de la entrada del túnel, la larga de este inervale es más largo que el del freno seguro de vehículos.<\/p>\n\n<p>Despues de entrar en el túnel,los conductores no pueden adaptarse rápidamente a la luminosidad visión de tunnel por una gran diferencia del brillo entre dentro y fuera y un retraso de adaptación. Para evitar esta situación, se debe hacer con el brillo visual disminuido lentamente de acuerdo con la velocidad de la adaptación de la visión a la entrada del túnel suavizando la intensidad de la transición, reduciando progresivamente el brillo con menos la proporción de 3:1 entre el anterior y el inferior, el brillo al pared con artura menos 2m debe superior al que medio en el camino.<\/p>\n\n<p>（２）Los problemas salidos en el proceso de pasar el túnel<\/p>\n\n<p>La iluminación en el túnel en el día es más brillante que la de fuera en la noche. Se reduce visibilidad por los humos producido por no poder disparar el escape de los automóviles en el túnel con muchos vehículos, y por la tanto identifica la visual muy difícil. Sobre todo la luz del cabeza del coche sea afectado mucho y no puede satisfacer la demanda de la visual. Generalmente ilumina con dos veces de luces para resolver los escapes de los automóviles.<\/p>\n\n<p>（３）Los problemas salidos a la salida del túnel.<\/p>\n\n<p>Ilumina mucho viendo por la salida del túnel, aparece un &quot;agujero brillante &quot; y muestra fuerte resplandor, sale un un &quot;agujero blanco&quot; y se llama el fenomero del agujero blanco. Hace agujero blanco como el agujero blanco, es muy identificar los vehículos por salir como sombra negra. Pero muy dificía ver claramente las sombras coincididos del camión y coches. La iluminación hecha para identificar los gran y pequeños vehículos coincididos se llama &quot;la iluminación de la salida&quot; la cuál tiene decenas de metros de larga.<\/p>\n\n<p>（４）Los problemas producidos antes de salir del túnel por la noche.<\/p>\n\n<p>Antes de llegar al fuera del túnel sin iluminación desde brillante luz en el túnel por la noche, Fuera de los túneles se ha convertido en un agujero negro y no puede ver línea de la carretera externos y los obstáculos en el camilo. En este momento debe parar iluminar dentro de la distancia mayor que el intervalo de seguridad a la carretera cerca de la salida del túnel para tener brillo adecuado.<\/p>\n\n<p>4、La aplicación de los led productos en el túnel.<\/p>\n\n<p>LED iluminación para túnel tiene inteligente sistema de sensor lo que puede ajustar automática la intensidad de brillo de acuerdo con la intensidad de la luz en el túnel en la aplicación de LED. Con la comparasión de fluorescentes, LED iluminación puede ahorrar 50% energía,y la vida es más 6-8 veces que la cual para disminuir muchas perdidas del consumos de la lámpara y costos del mantenimiento diario.<\/p>\n\n<p><a href=\"http:\/\/spain.spark-oe.com\/\" rel=\"nofollow\">http:\/\/spain.spark-oe.com\/<\/a><\/p>","introduction_rendered":"<p>A la diferencia de la iluminación ordinaria, LED iluminación para túnel tiene tiene su especificidad diferenciada. Es especialmente importante considerar la seguridad en el sistema de iluminación.<\/p>\n\n<p>Cuándo diseña el plan de iluminación del túnel, es necesario pensar que se ajusten y cumplan con los elementos de la oscuridad y brillo. Con el fin de satisfacer las demandas de cumplimiento de los ojos de los conductores necesita hacer iluminación y oscuridad de la transición en la entrada del túnel para garantizar la demanda de la visión. No hay otra forma de disposición por poco tiempo con menos de la habitual en el 1s en la salida del túnel.<\/p>\n\n<p>Túnel es un bloque de espacio cerrado, la luz natural no puede brillar lo interior. Incluso todo el día también necesita la iluminación artificial interior para garantizar la conectividad y la seguridad de la vida de los conductores. La iluminación de túneles es una parte integral para el proyecto del tunél.<\/p>\n\n<p>La discusión de la aplicación de la nueva fuente de luz de ahorro de energía fue la preocupación de la industria. La discusión de energía de ahorro de LED túnel que ha sido una grave perturbación. Según la visión clara y la teoría de la visión intermedia, el resultado de la investigación científica del color y la iluminación. La iluminación LED utilizados en el túnel tiene una ventaja. Por lo tanto, se han utilizado LED iluminación para túnel en muchos e importantes proyectos nacionales. LED Iluminación del túnel tuvo una alta interrupción en la aplicación del proyecto de la iluminación. Sin embargo, aún existen problemas. Por ejemplo, no dirige específicamente el diseño del fuente de LED iluminación de túnel y construcción de normas, el rendimiento del producto varía en gran medida, etc. En Europea 60% de los túneles se encuentran en Italia. Este es una aplicación práctica de los casos túnel en Roma, Italia.<\/p>\n\n<p>Escape de los automóviles, el ruido, la vibración, el aire puro, gases corrosivos, humedad y duras medio ambiente forma naturaleza especial de LED iluminación para túneles. Con el fin de garantir la seguridad a los vehículos de comunicación y peatones ambiente, Aquí están los siguientes análisis para describir pensamientos diseño y los métodos de la iluminación de túnel.<\/p>\n\n<p>SPARK adopta el tipo cuadrado de LED luz del túnel, por el presente tenemos LED1W 114-122Lm \/ W, Voltaje de 3.2V, alimentación de corriente 320hA. Por lo tanto, el trabajo práctico de una unidad LED es 1.024W, la potencia total de la fuente de la luz de 56 unidades son 61.6W. Nuestra eficiencia de poder de conversión es 86%, por lo tanto la potencia total son 72.6W, hay 103 unidades en túnel de 736m, total potencia 103×71.6=7374.8<wbr \/>.8W. Según el calculo de las 24 horas al día, el consumo de energía total es aproximadamente de 215,3 kWh de electricidad, alrededor de 71 950Kwh al año.<\/p>\n\n<p>La longitud del túnel son 736 metros, se adoptan LED iluminación de túnel con el control inteligente, en lugar de la manera de la práctica de cierre directa nocturno de la lámpara sodio tradicional, por lo tanto necesarias reajustar el brillo general de la unidad de lámpara densidad según la demanda del brillo del aire. El dispositivo anterior de planificación de lámpara sodio, constituyen tres regiones de brillo al abrir la luz brillante, el agujero de intervalo de 0 ~ 30 m es una región de alto brillo, la iluminación es 80lux, 30~60 m es una región de medio brillo, es 50lux, 60~96 m es una región de medio brillo, es 40lux, el brillo de unos 30Lux. Están poca luz en todo el túnel cuando se apaga las luces brillantes en la noche, es 30lux.<\/p>\n\n<p>Despues de adoptar la transformación de LED iluminación para túnel, se adoptar el control inteligente para controlar el brillo de la luz en la salida y entrada del túnel con 40 unidades LED iluminación para túnel, los 63 unidades en el medio lugar se trabajo con todo potencia para todo el año, el número total de luces son 103 unidades, son más 7 unidades que el diseño anterior. La manera con detalle es que instala un controlador sensible a la luz en la salida y entrada del túnel, adquirir la señal óptica, la señal óptica controla directamente la luminosidad de 40 unidades de LED lámpara del túnel, trabaja tomando el poder total a las buenas horas en el día, media potencia en la noche, el brillo cambia de acuerdo con los cambios de brillo del entorno externo, el controlador no consume electricidad. Todas lámparas a la salida y entrada trabaja con total potencia a las horas de buena luz fuera del túnel del día. En este punto el brillo puede satisfacesr completamente a la solicitud de 80,50,30 Lux. La luminosa es 40lux después de las lámparas trabaja con media potencia en la noche, todavía es 30lux dentro del túnel. Si usted no exige que el brillo cambia con el cambio del medio ambiente, puede establecer directamente un horario fijo para cambiar el brillo de LED lámpara del túnel.<\/p>\n\n<p>　<\/p>\n\n<p>Tiene los siguientes problemas especiales de carácter de la visión para general túnel.<\/p>\n\n<p>（1）Antes de entrar en el túnel (días): Como las grandes diferencias en el brillo dentro y fuera del túnel, así que verá un &quot;agujero negro&quot; fenómeno en la entrada del túnel con poco luz desde el exterior del túnel.<\/p>\n\n<p>（2）Despues de entrar en el túnel (días): Tras coche entrar al dentro del túnel con un poco más brillo, debe tener algún tiempo para ver la situación del interior del túnel, conocido como &quot;adaptación de histéresis&quot; retraso fenómeno.<\/p>\n\n<p>（3）A la salida del túnel, cuándo los coches pasan largo túnel y está cerca de la salida en el día. Parece un &quot;agujero blanco&quot; por mucho brillo a la salida, mostrará fuerte resplandor, los conductores se sienten no adaptable. Es contrario completamente noche y día,<\/p>\n\n<p>entonces aparece no &quot;agujero blanco&quot; pero &quot;agujero negro&quot; a la salida. Así que los conductores no puede ver línea de la carretera externos y los obstáculos en el camilo.<\/p>\n\n<p>Los superiores problemas más específica de visión necesita la solicitud con bastante demanda para la iluminación del túnel, puede resolvar eficaz estos problemas por los siguientes maneras;<\/p>\n\n<p>１、La colocación de la iluminación del túnel.<\/p>\n\n<p>La iluminación general del túnel se divide las cinco secciones de la iluminación como La sección de introducción, la sección de adaptación, la sección de transición, el segmento básico y la sección de la salida etc. Cada sección tiene mo la sección de introducción, cumplir con la sección, la sección de transiun papel diferente.<\/p>\n\n<p>（1）La sección de introducción: Eliminar el &quot;agujero negro&quot; fenómeno para que los conductores pueda identificar los obstáculos en la salida del túnel: Toma el día como el ejemplo, suponga que el brillo del medio ambiente de la boca del túnel son 4000cd\/m2, 80 km\/H a la velocidad, por lo tante puede satisfacer la demanda mínima de la sección de introducción con la larga 40 metros y brillo 80cd\/m2.<\/p>\n\n<p>（2）La sección de adaptación: despues de entrar en el túnel, los conductores puede adoptar rápida y eliminar el &quot;agujero negro&quot; fenómeno; Según las condiciones superiores, la sección de adaptación son 40 metros y brillo 80~46cd\/m2.<\/p>\n\n<p>（3）La sección de transición: Los conductores poco a poco adaptan la iluminación en el interior de los túneles; Según las condiciones superiores, la sección de adaptación son 40 metros y brillo 40~4.5cd\/m.<\/p>\n\n<p>（4）La sección del segmento básico: La iluminación básicas dentro del túnel<\/p>\n\n<p>（5）La sección de la salida: Los conductores poco a poco adaptan la iluminación en el interior de los túneles en el día, eliminar el &quot;agujero blanco&quot; fenómeno; La práctica común es que iluminan continuamente por LED alumbrado público al lugar fuera del túnel para que los conductores pueda ver línea de la carretera externos y los obstáculos en el camilo y eliminar el &quot;agujero negro&quot; fenómeno en la noche.<\/p>\n\n<p>Durante el día, la luz de la salida y la de la entrada es más brillante que la que interior en el túnel; Por el contrario, en la noche la cuál debe ser inferior al la interior. Cuando led alumbrado público está iluminando fuera del túnel, el brillo en el aire son dos veces al que en el suelo del túnel.<\/p>\n\n<p>2、Los problemas existidos en el proceso de que los vehículos pasan.<\/p>\n\n<p>3、Los problemas existidos en el proceso cerca de túnel<\/p>\n\n<p>（1）El &quot;agujero negro&quot; fenómeno<\/p>\n\n<p>En el día, los ojos del conductor se han adaptado la luz natural exterior de más 100000 lx y unos mil cd\/m2, cuando los ojos se encuentra unos cd\/m2 de brillo en el túnel, presenta histéresis debido a la limitad de la percepción de los ojos humanos a la diferencia del brillo, Verás una cueva negro, entonces no puede identificar lo que estaba en el túnel. Este fenómeno de ver el agujero negro en el medio ambiente brillante se llama el fenómeno de agujero negro al cuál sale, los conductores sólo puede ver corto visión , no puede conducir con seguridad con el vehículo cerca del túnel. Negro agujero es el problema producido antes entrar en el túnel, de la aparición del fenómeno de problemas visuales, es el problema más importante en la iluminación del túnel. Para evitar la aparición del fenómeno de agujero negro, debe garantizar el suficiente brillo a los intervales de la sección de la entrada del túnel, la larga de este inervale es más largo que el del freno seguro de vehículos.<\/p>\n\n<p>Despues de entrar en el túnel,los conductores no pueden adaptarse rápidamente a la luminosidad visión de tunnel por una gran diferencia del brillo entre dentro y fuera y un retraso de adaptación. Para evitar esta situación, se debe hacer con el brillo visual disminuido lentamente de acuerdo con la velocidad de la adaptación de la visión a la entrada del túnel suavizando la intensidad de la transición, reduciando progresivamente el brillo con menos la proporción de 3:1 entre el anterior y el inferior, el brillo al pared con artura menos 2m debe superior al que medio en el camino.<\/p>\n\n<p>（２）Los problemas salidos en el proceso de pasar el túnel<\/p>\n\n<p>La iluminación en el túnel en el día es más brillante que la de fuera en la noche. Se reduce visibilidad por los humos producido por no poder disparar el escape de los automóviles en el túnel con muchos vehículos, y por la tanto identifica la visual muy difícil. Sobre todo la luz del cabeza del coche sea afectado mucho y no puede satisfacer la demanda de la visual. Generalmente ilumina con dos veces de luces para resolver los escapes de los automóviles.<\/p>\n\n<p>（３）Los problemas salidos a la salida del túnel.<\/p>\n\n<p>Ilumina mucho viendo por la salida del túnel, aparece un &quot;agujero brillante &quot; y muestra fuerte resplandor, sale un un &quot;agujero blanco&quot; y se llama el fenomero del agujero blanco. Hace agujero blanco como el agujero blanco, es muy identificar los vehículos por salir como sombra negra. Pero muy dificía ver claramente las sombras coincididos del camión y coches. La iluminación hecha para identificar los gran y pequeños vehículos coincididos se llama &quot;la iluminación de la salida&quot; la cuál tiene decenas de metros de larga.<\/p>\n\n<p>（４）Los problemas producidos antes de salir del túnel por la noche.<\/p>\n\n<p>Antes de llegar al fuera del túnel sin iluminación desde brillante luz en el túnel por la noche, Fuera de los túneles se ha convertido en un agujero negro y no puede ver línea de la carretera externos y los obstáculos en el camilo. En este momento debe parar iluminar dentro de la distancia mayor que el intervalo de seguridad a la carretera cerca de la salida del túnel para tener brillo adecuado.<\/p>\n\n<p>4、La aplicación de los led productos en el túnel.<\/p>\n\n<p>LED iluminación para túnel tiene inteligente sistema de sensor lo que puede ajustar automática la intensidad de brillo de acuerdo con la intensidad de la luz en el túnel en la aplicación de LED. Con la comparasión de fluorescentes, LED iluminación puede ahorrar 50% energía,y la vida es más 6-8 veces que la cual para disminuir muchas perdidas del consumos de la lámpara y costos del mantenimiento diario.<\/p>\n\n<p><a href=\"http:\/\/spain.spark-oe.com\/\" rel=\"nofollow\">http:\/\/spain.spark-oe.com\/<\/a><\/p>","locale":"en","parts":[],"prereqs":[],"steps":[{"title":"","lines":[{"text":"Insert wisdom here.","text_raw":"Insert wisdom here.","bullet":"black","level":0}],"object":null,"images":[],"number":1}],"subject":"","summary":"Túnel es un bloque de espacio cerrado, la luz natural no puede brillar lo interior. Incluso todo el día también necesita la iluminación artificial interior para garantizar la conectividad y la seguridad de la vida de los conductores. La iluminación d","time_required":null,"title":"El diseño de la iluminación de LED iluminación para túnel","tools":[],"type":"project"},"guideid":"125"}