{"device":"Biology","url":"http:\/\/makeprojects.com\/Project\/How+to%3A+Make+Bacterial+Broth-Agar\/172\/1","guide":{"author":{"text":"CathalGarvey","userid":540},"categories":["Biology"],"conclusion":"","difficulty":"Moderate","documents":[],"flags":[{"title":"Unpublished","flagid":"GUIDE_PRIVATE","text":"This project guide will not appear in search results but can still be viewed by anyone!"},{"title":"User-Contributed Project","flagid":"GUIDE_USER_CONTRIBUTED","text":"This project guide is not managed by MAKE staff."}],"guideid":172,"image":{"imageid":0,"text":"http:\/\/cacher.dozuki.net\/static\/images\/make\/guide\/NoImageMP_96x72.gif"},"introduction":"<p>&quot;Broth&quot; is a catch-all term for any liquid medium in which we grow bacteria. The most popular for growing E.coli is &quot;Lysogeny Broth&quot;, and I'll show you here how to make this and other media using only off-the-shelf ingredients.<\/p>\n\n<p>If you want to make petri dishes of agar for growing cells on a solid surface, you simply add agar flakes to the broth before you sterilise it, and then pour it before it cools too much! It couldn't be easier.<\/p>\n\n<p>This guide will cover:<\/p>\n\n<ol><li>Finding Ingredients<\/li><li>Making peptone<\/li><li>Mixing broth according to a formula<\/li><li>Sterilising with a pressure cooker<\/li><li>Pouring plates (if using agar)<\/li><li>Keeping it sterile while you work<\/li><\/ol>\n\n<p>Things you may need besides the ingredients:<\/p>\n\n<ol><li>A pressure cooker, and perhaps some help using it if you're unfamiliar with them.<\/li><li>A room air-purifier with a HEPA-type filter<\/li><li>An alcohol-based hand disinfectant, (or ethanol at 70% if you can get it)<\/li><li>Some glassware that will survive pressure cooking. Jam jars work well.<\/li><\/ol>\n\n<p>More on this soon as I gather my notes and pictures into something manageable!<\/p>","introduction_rendered":"<p>&quot;Broth&quot; is a catch-all term for any liquid medium in which we grow bacteria. The most popular for growing E.coli is &quot;Lysogeny Broth&quot;, and I'll show you here how to make this and other media using only off-the-shelf ingredients.<\/p>\n\n<p>If you want to make petri dishes of agar for growing cells on a solid surface, you simply add agar flakes to the broth before you sterilise it, and then pour it before it cools too much! It couldn't be easier.<\/p>\n\n<p>This guide will cover:<\/p>\n\n<ol><li>Finding Ingredients<\/li><li>Making peptone<\/li><li>Mixing broth according to a formula<\/li><li>Sterilising with a pressure cooker<\/li><li>Pouring plates (if using agar)<\/li><li>Keeping it sterile while you work<\/li><\/ol>\n\n<p>Things you may need besides the ingredients:<\/p>\n\n<ol><li>A pressure cooker, and perhaps some help using it if you're unfamiliar with them.<\/li><li>A room air-purifier with a HEPA-type filter<\/li><li>An alcohol-based hand disinfectant, (or ethanol at 70% if you can get it)<\/li><li>Some glassware that will survive pressure cooking. Jam jars work well.<\/li><\/ol>\n\n<p>More on this soon as I gather my notes and pictures into something manageable!<\/p>","locale":"en","parts":[],"prereqs":[],"steps":[{"title":"","lines":[{"text":"I'll be compiling this guide soon, but it's simply a friendly re-write of my guide to be found here (in case you're impatient): <a href=\"http:\/\/letters.cunningprojects.com\/?p=97\" rel=\"nofollow\">http:\/\/letters.cunningprojects.com\/?p=97<\/a>","text_raw":"I'll be compiling this guide soon, but it's simply a friendly re-write of my guide to be found here (in case you're impatient): http:\/\/letters.cunningprojects.com\/?p=97","bullet":"black","level":0},{"text":"Left: A shot of all the ingredients I used to make bacterial broth. If it looks amateurish, that's the point. I've proven already that these ingredients are more than sufficient to isolate and grow some really cool glowing bacteria from fish, so trust me: it works great!","text_raw":"Left: A shot of all the ingredients I used to make bacterial broth. If it looks amateurish, that's the point. I've proven already that these ingredients are more than sufficient to isolate and grow some really cool glowing bacteria from fish, so trust me: it works great!","bullet":"black","level":0},{"text":"First things first, get to know ingredients.","text_raw":"First things first, get to know ingredients.","bullet":"black","level":0},{"text":"<strong>Yeast Extract<\/strong> is a wonderful foodstuff full of vitamins, minerals and protein. It is made by keeping yeast at about 65C for three days, during which time it basically eats itself. In broth-making, it's used to provide the same nutrition for the bacteria that it does for us.","text_raw":"'''Yeast Extract''' is a wonderful foodstuff full of vitamins, minerals and protein. It is made by keeping yeast at about 65C for three days, during which time it basically eats itself. In broth-making, it's used to provide the same nutrition for the bacteria that it does for us.","bullet":"black","level":1},{"text":"<strong>Tryptone and Phytone<\/strong> are two of many different kinds of <strong>Peptone<\/strong>. Peptone is a mix of semi-digested proteins, providing easily-digested building material for bacteria. Some bacteria can use Peptone as a carbon source (in other words, for energy), others require a separate source such as sugar, certain alcohols or stranger things still.","text_raw":"'''Tryptone and Phytone''' are two of many different kinds of '''Peptone'''. Peptone is a mix of semi-digested proteins, providing easily-digested building material for bacteria. Some bacteria can use Peptone as a carbon source (in other words, for energy), others require a separate source such as sugar, certain alcohols or stranger things still.","bullet":"black","level":1},{"text":"<strong>Glycerol<\/strong> is used in some media as a <em>carbon source<\/em> to provide the bacteria with energy. Higher concentrations are also used as a &quot;cryoprotectant&quot; to protect bacteria from death during freezing and thawing, but this is added right before freezing rather than when making the broth.","text_raw":"'''Glycerol''' is used in some media as a ''carbon source'' to provide the bacteria with energy. Higher concentrations are also used as a \"cryoprotectant\" to protect bacteria from death during freezing and thawing, but this is added right before freezing rather than when making the broth.","bullet":"black","level":1},{"text":"<strong>Calcium Carbonate<\/strong> is used in some media as a <em>pH buffer<\/em>, for the same reason that it's used in so many antacids. As bacteria grow and metabolise and excrete wastes, the broth can get very acidic, and calcium carbonate can help slow this down by <em>buffering<\/em> the broth toward the alkaline end of the scale for at least a while.","text_raw":"'''Calcium Carbonate''' is used in some media as a ''pH buffer'', for the same reason that it's used in so many antacids. As bacteria grow and metabolise and excrete wastes, the broth can get very acidic, and calcium carbonate can help slow this down by ''buffering'' the broth toward the alkaline end of the scale for at least a while.","bullet":"black","level":1},{"text":"<strong>Bromelain, Papain<\/strong> or a host of other fruit protein-digesting enzymes can be used in place of <em>trypsin<\/em> in order to make <em>peptone<\/em>. Because <em>trypsin<\/em> is extracted from calf stomachs almost exclusively for science, it's hard to get it in shops. <em>Bromelain<\/em> the enzyme mix responsible for the sharpness of pineapples, is a fairly versatile and heat-stable way of digesting proteins, and you can buy it as a digestive aid in health stores or as a meat tenderiser. Careful: it can reopen wounds in your mouth if you eat a concentrated amount, or perhaps even on your skin if you let it!","text_raw":"'''Bromelain, Papain''' or a host of other fruit protein-digesting enzymes can be used in place of ''trypsin'' in order to make ''peptone''. Because ''trypsin'' is extracted from calf stomachs almost exclusively for science, it's hard to get it in shops. ''Bromelain'' the enzyme mix responsible for the sharpness of pineapples, is a fairly versatile and heat-stable way of digesting proteins, and you can buy it as a digestive aid in health stores or as a meat tenderiser. Careful: it can reopen wounds in your mouth if you eat a concentrated amount, or perhaps even on your skin if you let it!","bullet":"black","level":1}],"object":null,"images":[{"imageid":3553,"orderby":1,"text":"http:\/\/guide-images.makeprojects.org\/igi\/qxSfNsmSachuwF3M"}],"number":1}],"subject":"","summary":"How to make the liquid and solid growth media used to select and propagate bacteria in science labs, using only materials you can find in a day's shopping.","time_required":"2 hours shopping, 2 hours' work (first time)","title":"How to: Make Bacterial Broth\/Agar","tools":[],"type":"technique"},"guideid":"172"}