{"device":"Outdoors","url":"http:\/\/makeprojects.com\/Project\/A+capstan+based+kite+winder\/2265\/1","guide":{"author":{"text":"Albert den Haan","userid":11385},"categories":["Outdoors","Outdoors"],"conclusion":"<h2 id=\"Section_Tips_for_use\">Tips for use.<\/h2>\n\n<p>Practice threading, winding in and winding out before dealing with a taught line from a kite in the air.  Suspending a weight from the line over the top of a door is a good simulation of the real thing.<\/p>\n\n<p>To thread the line under tension I start by holding the winder against my waist with the crosspiece pointing along the line and the halo in the non-cranking hand. Then I take an arm's length of line from above the halo and wind it around the capstan by bringing it toward my body above the drum and back toward the kite below the drum.  I do this at least 3 times so the tension will be completely managed by the drum.<\/p>\n\n<p>Then I drop the line to the kite through the first fairlead eye screw, and crank the capstan around a few times to verify its grip on the line and give me enough slack to thread the line to the halo though the two remaining fairleads before plugging the halo onto the foam adaptor oriented so the string winds the same way as on the capstan.<\/p>\n\n<p>Now you are ready to crank away on whichever handle matches the line tension.  Make sure the halo is aligned with the last fairlead so that the line winds onto the reel and not the axle or foam.  Note that some run-out or wobble of the halo is a good thing: it promotes level winding.<\/p>\n\n<p>The power drill option can be too much of a good thing if the spinning parts are out of balance. Use light crank material and light handles and you should be O.K. for reasonable cranking speeds.  Be carefull not to overstress your kite or kite line by pulling it in too fast!  Also beware of the kite overflying you if the wind is moderate.<\/p>\n\n<p>A small capstan can wind onto many (larger) sizes of reels. The example 8 inch halo seems to be about the workable limit.<\/p>\n\n<p>This thing should scale up to handle strong pulling kites easily. Obvious changes to handle heavier pulls are: a heavier spine, a waist strap, ball bearings or bushings on a thicker axle, a heavier removable crank, and a solid brake will be enough to take the challenge. The wheel hub should be able to handle a lot of pull as it is.<\/p>","difficulty":"Moderate","documents":[],"flags":[{"title":"User-Contributed Project","flagid":"GUIDE_USER_CONTRIBUTED","text":"This project guide is not managed by MAKE staff."}],"guideid":2265,"image":{"imageid":44385,"text":"http:\/\/guide-images.makeprojects.org\/igi\/vuTgVlDIYAg2JTmy"},"introduction":"<p>This winder is built from standard hardware store parts with common tools in a few hours. Because the line storage is not limited by the size of the winder, the mechanical advantage of a small capstan can be used to pull in a lot of line.<\/p>\n\n<p>Winding the line directly on a lightweight spool under high stress risks of collapsing the destination reel due to the elastic band effect. This design limits the tension on the takeup reel to the minimal amount to make sure the line will all get on the reel.<\/p>\n\n<p>The robustness, strength, and small size of the reel\/winch comes from the hub of a small lawnmower wheel as a capstan with a long 5\/16&quot; steel axle bolt mounted on a hefty wooden dowel. The widely available, lightweight halo reel is supported with soft, lightweight open cell foam that forms part of the slipper clutch that limits the winding tension.<\/p>\n\n<p>The dowel is fitted for one hand to hold braced against the cranker's waist while the other hand powers the capstan with either the high power or high speed knobs on the crank handle, or a drill chucked with a nut driver to match the axle bolt head.<\/p>\n\n<p>The materials are chosen for easy construction in a decently equiped home workshop. The trickiest operation is cross drilling the axle twice for a cotter pin and a hitch pin.<\/p>\n\n<p>Some care is needed for threading the kite line on the winch--especially with strong pulls (use gloves)--but it is a straight forward operation once learned. Launching and flying the kite to altitude is still easily done with the halo, and the winding down done with the winch. The winch can be used to wind out line also but this requires extra manual care, or a drum adaptor specific to the halo size.<\/p>","introduction_rendered":"<p>This winder is built from standard hardware store parts with common tools in a few hours. Because the line storage is not limited by the size of the winder, the mechanical advantage of a small capstan can be used to pull in a lot of line.<\/p>\n\n<p>Winding the line directly on a lightweight spool under high stress risks of collapsing the destination reel due to the elastic band effect. This design limits the tension on the takeup reel to the minimal amount to make sure the line will all get on the reel.<\/p>\n\n<p>The robustness, strength, and small size of the reel\/winch comes from the hub of a small lawnmower wheel as a capstan with a long 5\/16&quot; steel axle bolt mounted on a hefty wooden dowel. The widely available, lightweight halo reel is supported with soft, lightweight open cell foam that forms part of the slipper clutch that limits the winding tension.<\/p>\n\n<p>The dowel is fitted for one hand to hold braced against the cranker's waist while the other hand powers the capstan with either the high power or high speed knobs on the crank handle, or a drill chucked with a nut driver to match the axle bolt head.<\/p>\n\n<p>The materials are chosen for easy construction in a decently equiped home workshop. The trickiest operation is cross drilling the axle twice for a cotter pin and a hitch pin.<\/p>\n\n<p>Some care is needed for threading the kite line on the winch--especially with strong pulls (use gloves)--but it is a straight forward operation once learned. Launching and flying the kite to altitude is still easily done with the halo, and the winding down done with the winch. The winch can be used to wind out line also but this requires extra manual care, or a drum adaptor specific to the halo size.<\/p>","locale":"en","parts":[],"prereqs":[],"steps":[],"subject":"","summary":"This hand cranked (with a power option) capstan pulls down kites easily and quickly but light-weight and small to be portable. The line ends up on a removable halo spool so many spools of with varying weights of line can be used on one winder.","time_required":"1 to 4 hours","title":"A capstan based kite winder","tools":[],"type":"project"},"guideid":"2265"}